Diplom1C/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
</mdclass:DataProcessor>

Diplom1C/src/AccumulationRegisters/ВКМ_ЗадолженностиКлиентов/ВКМ_ЗадолженностиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ЗадолженностиКлиентов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom1C/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom1C/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы 

&НаКлиенте
Асинх Процедура ЗаполнитьДанные(Команда)
	
    ДлительнаяОперация = ВыполнитьВФонеНаСервере(); 
    
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
    ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;

    ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполенияОбработки", ЭтотОбъект);
    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция ВыполнитьВФонеНаСервере()
      
    ПараметрыВыполненияПроцедуры = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	
	ДанныеВыполнения = Новый Структура;
	ДанныеВыполнения.Вставить("Начало",    Период.ДатаНачала);
	ДанныеВыполнения.Вставить("Окончание", Период.ДатаОкончания);
	
    ПараметрыВыполнения = Новый Структура;
    ПараметрыВыполнения.Вставить("ИмяМетода", "ЗаполнитьРеализацииПоДоговорам");
    ПараметрыВыполнения.Вставить("ЭтоВнешняяОбработка", Ложь);   
    ПараметрыВыполнения.Вставить("ПараметрыВыполнения", ДанныеВыполнения); 
	
    Адрес = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
    
    Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполненияПроцедуры,"Обработка.ВКМ_МассовоеСозданиеАктов.МодульОбъекта.ЗаполнитьРеализацииПоДоговорам",ПараметрыВыполнения, Адрес); 
    
КонецФункции

&НаКлиенте
Процедура ПослеВыполенияОбработки(Результат, ДопПараметры) Экспорт
    
    Текст = "Завершено";
    
    Если Результат = Неопределено Тогда
        Текст = "Задание отменено";
    ИначеЕсли Результат.Статус = "Ошибка" Тогда
        Текст = "Выполение завершилось с ошибкой";
    ИначеЕсли Результат.Статус = "Выполнено" Тогда
        Текст = "Завершено успешно";
		ВКМ_ЗаполнитьРеализацииПоДоговорам();
    КонецЕсли;
    
    ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
    
КонецПроцедуры  

Процедура ВКМ_ЗаполнитьРеализацииПоДоговорам() 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_Договор КАК ВКМ_Договор,
	|	СУММА(ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_СуммаОборот) КАК ВКМ_СуммаОборот
	|ПОМЕСТИТЬ ВТ_Задолженности
	|ИЗ
	|	РегистрНакопления.ВКМ_ЗадолженностиКлиентов.Обороты(&НП, &КП, , ) КАК ВКМ_ЗадолженностиКлиентовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задолженности.ВКМ_Договор КАК Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, НЕОПРЕДЕЛЕНО) КАК Реализация
	|ИЗ
	|	ВТ_Задолженности КАК ВТ_Задолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Задолженности.ВКМ_Договор = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Проведен)";
	
	Запрос.УстановитьПараметр("НП", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КП", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокДокументов.Загрузить(РезультатЗапроса.Выгрузить());
			
КонецПроцедуры

#КонецОбласти
